mbielicki/dw3000/Build_Platforms/nRF52840-DK/sdk/examples/myprojects/distance_service/main.c
#include <stdbool.h>
#include <stdint.h>
#include <string.h>

#include "nordic_common.h"
#include "nrf.h"
#include "app_error.h"
#include "ble.h"
#include "ble_hci.h"
#include "ble_srv_common.h"
#include "ble_advdata.h"
#include "ble_advertising.h"
#include "ble_conn_params.h"
#include "nrf_sdh.h"
#include "nrf_sdh_soc.h"
#include "nrf_sdh_ble.h"
#include "app_timer.h"
#include "fds.h"
#include "peer_manager.h"
#include "peer_manager_handler.h"
#include "bsp_btn_ble.h"
#include "sensorsim.h"
#include "ble_conn_state.h"
#include "nrf_ble_gatt.h"
#include "nrf_ble_qwr.h"
#include "nrf_pwr_mgmt.h"

#include "nrf_log.h"
#include "nrf_log_ctrl.h"
#include "nrf_log_default_backends.h"


#define DEVICE_NAME                     "Nordic_Template"                       /**< Name of device. Will be included in the advertising data. */
#define MANUFACTURER_NAME               "NordicSemiconductor"                   /**< Manufacturer. Will be passed to Device Information Service. */
#define APP_ADV_INTERVAL                300                                     /**< The advertising interval (in units of 0.625 ms. This value corresponds to 187.5 ms). */

#define APP_ADV_DURATION                18000                                   /**< The advertising duration (180 seconds) in units of 10 milliseconds. */
#define APP_BLE_OBSERVER_PRIO           3                                       /**< Application's BLE observer priority. You shouldn't need to modify this value. */
#define APP_BLE_CONN_CFG_TAG            1                                       /**< A tag identifying the SoftDevice BLE configuration. */

#define MIN_CONN_INTERVAL               MSEC_TO_UNITS(100, UNIT_1_25_MS)        /**< Minimum acceptable connection interval (0.1 seconds). */
#define MAX_CONN_INTERVAL               MSEC_TO_UNITS(200, UNIT_1_25_MS)        /**< Maximum acceptable connection interval (0.2 second). */
#define SLAVE_LATENCY                   0                                       /**< Slave latency. */
#define CONN_SUP_TIMEOUT                MSEC_TO_UNITS(4000, UNIT_10_MS)         /**< Connection supervisory timeout (4 seconds). */

#define FIRST_CONN_PARAMS_UPDATE_DELAY  APP_TIMER_TICKS(5000)                   /**< Time from initiating event (connect or start of notification) to first time sd_ble_gap_conn_param_update is called (5 seconds). */
#define NEXT_CONN_PARAMS_UPDATE_DELAY   APP_TIMER_TICKS(30000)                  /**< Time between each call to sd_ble_gap_conn_param_update after the first call (30 seconds). */
#define MAX_CONN_PARAMS_UPDATE_COUNT    3                                       /**< Number of attempts before giving up the connection parameter negotiation. */

#define SEC_PARAM_BOND                  1                                       /**< Perform bonding. */
#define SEC_PARAM_MITM                  0                                       /**< Man In The Middle protection not required. */
#define SEC_PARAM_LESC                  0                                       /**< LE Secure Connections not enabled. */
#define SEC_PARAM_KEYPRESS              0                                       /**< Keypress notifications not enabled. */
#define SEC_PARAM_IO_CAPABILITIES       BLE_GAP_IO_CAPS_NONE                    /**< No I/O capabilities. */
#define SEC_PARAM_OOB                   0                                       /**< Out Of Band data not available. */
#define SEC_PARAM_MIN_KEY_SIZE          7                                       /**< Minimum encryption key size. */
#define SEC_PARAM_MAX_KEY_SIZE          16                                      /**< Maximum encryption key size. */

#define DEAD_BEEF                       0xDEADBEEF                              /**< Value used as error code on stack dump, can be used to identify stack location on stack unwind. */


NRF_BLE_GATT_DEF(m_gatt);                                                       /**< GATT module instance. */
NRF_BLE_QWR_DEF(m_qwr);                                                         /**< Context for the Queued Write module.*/
BLE_ADVERTISING_DEF(m_advertising);                                             /**< Advertising module instance. */

static uint16_t m_conn_handle = BLE_CONN_HANDLE_INVALID;                        /**< Handle of the current connection. */

#define CUSTOM_SERVICE_UUID_BASE {0x23, 0x15, 0x12, 0xE7, 0xD4, 0x6F, 0x8C, 0xAF, \
                                  0x85, 0xC1, 0x56, 0x12, 0x00, 0x00, 0x00, 0x00}
#define CUSTOM_SERVICE_UUID         0x1400
#define CUSTOM_DISTANCE_CHAR_UUID   0x1401

typedef struct
{
    uint16_t                    service_handle;
    ble_gatts_char_handles_t    distance_char_handles;
    uint8_t                     uuid_type;
} ble_custom_service_t;

ble_custom_service_t custom_service;

static uint32_t custom_service_init(ble_custom_service_t * p_service)
{
    uint32_t err_code;
    ble_uuid_t ble_uuid;
    ble_uuid128_t custom_base_uuid = CUSTOM_SERVICE_UUID_BASE;

    // Add custom base UUID
    err_code = sd_ble_uuid_vs_add(&custom_base_uuid, &p_service->uuid_type);
    VERIFY_SUCCESS(err_code);

    ble_uuid.type = p_service->uuid_type;
    ble_uuid.uuid = CUSTOM_SERVICE_UUID;

    // Add the service
    err_code = sd_ble_gatts_service_add(BLE_GATTS_SRVC_TYPE_PRIMARY,
                                        &ble_uuid,
                                        &p_service->service_handle);
    VERIFY_SUCCESS(err_code);

    // Add Distance Characteristic
    ble_gatts_char_md_t char_md = {0};
    ble_gatts_attr_md_t cccd_md = {0};
    ble_gatts_attr_t attr_char_value = {0};
    ble_uuid_t char_uuid;
    ble_gatts_attr_md_t attr_md = {0};

    char_md.char_props.read = 1; // Readable characteristic
    char_md.p_cccd_md = NULL;

    char_uuid.type = p_service->uuid_type;
    char_uuid.uuid = CUSTOM_DISTANCE_CHAR_UUID;

    attr_md.read_perm.sm = 1;
    attr_md.read_perm.lv = 1;
    attr_md.vloc = BLE_GATTS_VLOC_STACK;
    attr_md.vlen = 1;

    uint16_t initial_distance = 0; // Placeholder for the distance value
    attr_char_value.p_uuid = &char_uuid;
    attr_char_value.p_attr_md = &attr_md;
    attr_char_value.init_len = sizeof(uint16_t);
    attr_char_value.init_offs = 0;
    attr_char_value.max_len = sizeof(uint16_t);
    attr_char_value.p_value = (uint8_t *)&initial_distance;

    return sd_ble_gatts_characteristic_add(p_service->service_handle,
                                           &char_md,
                                           &attr_char_value,
                                           &p_service->distance_char_handles);
}
uint32_t custom_service_distance_update(ble_custom_service_t * p_service, uint16_t distance)
{
    uint16_t len = sizeof(distance);

    ble_gatts_value_t value = {0};
    value.len = len;
    value.offset = 0;
    value.p_value = (uint8_t *)&distance;

    return sd_ble_gatts_value_set(BLE_CONN_HANDLE_INVALID,
                                  p_service->distance_char_handles.value_handle,
                                  &value);
}



/* YOUR_JOB: Declare all services structure your application is using
 *  BLE_XYZ_DEF(m_xyz);
 */

